<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
  "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr" lang="fr">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
  <title>TextMorph</title>
    	<link rel="stylesheet"  href="ui/css/styleCommuns.css" type="text/css" media="screen" />
	<link rel="stylesheet"  href="ui/css/print.css" type="text/css" media="print" />
	<link rel="stylesheet"  href="ui/css/pagesInt.css" type="text/css" media="screen" />
	<script type="text/javascript" src="ui/js/mootools-1.2.4-core-nc.js.txt"></script>

    <script type="text/javascript" src="ui/js/javascript.js"></script>
</head>
<body><h1>TextMorph</h1>
<h2>Pr&eacute;sentation
</h2>
<p>TextMorph est un plugin disponible pour mootools ainsi que jquery qui permet de r&eacute;aliser des formes avec un texte. Il se base sur les sp&eacute;cifications css en cours css 2.1 (disponible en version <a href="http://www.w3.org/TR/CSS21/">anglaise</a> et <a href="http://www.yoyodesign.org/doc/w3c/css2/cover.html">française</a>).</p>
<h2>Principe</h2>

<p>TextDraw s'appuie sur deux propri&eacute;t&eacute;s pr&eacute;sente dans la normes css, le float et le margin-top, en les combinant de mani&egrave;re a faire apparaitre le texte au bord de multiples div dont la taille est calcul&eacute;e pour donn&eacute; un aspect pr&eacute;d&eacute;termin&eacute;.</p>
<div class="image"><img src="entrepot/schema1.png" alt="Sch&eacute;ma1" width="689" height="246" />
<div class="legende">Fonctionnement du plugin - de la l'aspect initial au r&eacute;sultat final</div></div>
<p>Deux div sont ainsi ajout&eacute;es sur chaque ligne. L'une flotte à droite, l'autre à gauche. Une div suppl&eacute;mentaire est ajout&eacute; et comporte l'attribut css clear:both afin de permettre d'&eacute;crire la ligne suivante. Le texte est quand à lui inclus dans une div diff&eacute;rente, il est c&eacute;sur&eacute; de mani&egrave;re basique (voir l'expliquation sur les c&eacute;sures), et r&eacute;gl&eacute; avec un margin-top n&eacute;gatif de la taille de la div initial (ou du param&egrave;tre height, si celui-ci est pass&eacute; à la fonction).</p>
<h2>Disponibilit&eacute;s</h2>
<p>Ce plugin est diponibles pour les frameworks <a href="http://plugins.jquery.com/project/textmorph">jquery</a> et <a href="http://mootools.net/forge/p/fx_textmorph">mootools</a>.</p>
<h2>Les C&eacute;sures</h2>

<p>Les c&eacute;sures sont r&eacute;alis&eacute;es par ce plugin de mani&egrave;re simpliste, elle sont d&eacute;sactivable avec le param&egrave;tre shy. L'int&eacute;rêt &eacute;tant d'ajouter un syst&egrave;me de c&eacute;sure plus puissant javascript ou php. En effet, outre le non suivi des r&egrave;gles de c&eacute;sure communn&eacute;ment admise, chaque langues ayant des r&egrave;gles diff&eacute;rentes qui peuvent s'av&eacute;rer complexes, la fonction r&eacute;alisant les c&eacute;sures oblit&egrave;re toutes les balises int&eacute;gr&eacute;es dans le texte à former.</p>
<h3>exemple</h3>
<pre class="javascript">
new TextMorph(document.getElementById('circle2'),{
	shy:null
});
</pre>
<ul>
<li id="menu1"  class="choice"><a href="?p=textmorph">TextMorph</a></li><li id="menu2"  class=""><a href="?p=textmorph"></a></li></ul>
<div id="pied">
</div>
</body>
</html>